tap "argoproj/tap"
tap "caarlos0/tap"
tap "depot/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kajabi/kjctl", "git@github.com:Kajabi/kjctl.git"
tap "kreuzwerker/taps"
tap "puma/puma"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
tap "ynqa/tap"


brew "cffi"
brew "openssl@3"
brew "cryptography"
brew "libyaml"
brew "readline"
brew "xz"
brew "ansible"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "argocd"
brew "autoconf"
brew "coreutils"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "awsume"
brew "bat"
brew "glib", link: false
brew "cairo"
brew "circleci"
brew "container-diff"
brew "ctags"
brew "direnv"
brew "docutils"
brew "expat"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "snappy"
brew "openvino"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "libksba"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "helm"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "ispell"
brew "jq"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "openjdk@11"
brew "languagetool", restart_service: true
brew "libffi"
brew "libpq"
brew "librsvg"
brew "libxml2"
brew "libxslt"
brew "lsd"
brew "mas"
brew "mcfly"
brew "memcached", restart_service: true
brew "minikube"
brew "node-build"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "pipx"
brew "postgresql@12", restart_service: true
brew "python@3.10"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "rclone"
brew "redis", restart_service: true
brew "ripgrep"
brew "ripgrep-all"
brew "shellcheck"
brew "tcl-tk"
brew "terraformer"
brew "the_silver_searcher"
brew "tokei"
brew "tree-sitter"
brew "vault"
brew "watch"
brew "yarn"
brew "yq"
brew "zlib"

brew "argoproj/tap/kubectl-argo-rollouts"
brew "caarlos0/tap/org-stats"
brew "depot/tap/depot"
brew "hashicorp/tap/terraform-ls"
brew "kajabi/kjctl/kjctl"
brew "kreuzwerker/taps/m1-terraform-provider-helper"
brew "puma/puma/puma-dev"
brew "railwaycat/emacsmacport/emacs-mac"
brew "ynqa/tap/jnv"

cask "1password-cli"
cask "aws-vpn-client"
# cask "cheatsheet"
cask "datadog-agent"
cask "docker"
cask "iterm2"
cask "loom"
cask "ngrok"
cask "tuple"
cask "visual-studio-code"
cask 'caffeine'
cask 'dash'
cask 'github'
cask 'wireshark'


# Fonts
cask 'font-3270-nerd-font'
cask 'font-agave-nerd-font'
cask 'font-anonymice-nerd-font'
cask 'font-arimo-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-awesome-terminal-fonts'  # Font Awesome for terminal
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code' # Fira Code font
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-gohufont-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-heavy-data-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-im-writing-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-monofur-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-mplus-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-open-dyslexic-nerd-font'
cask 'font-overpass-nerd-font'
cask 'font-profont-nerd-font'
cask 'font-proggy-clean-tt-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-shure-tech-mono-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'font-terminess-ttf-nerd-font'
cask 'font-tinos-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'homebrew/cask-fonts/font-fontawesome' # Font Awesome


mas "Magnet", id: 441258766
