tap 'heroku/brew'
tap 'homebrew/cask'
tap 'railwaycat/emacsmacport'
tap 'puma/puma'
tap 'argoproj/tap'

brew 'argocd'
brew 'autoconf'
brew 'automake' # snappy dependency
brew 'awscli'
brew 'awsume'
brew 'bat'
brew 'circleci'
brew 'ctags'
brew 'direnv'
brew 'emacs-mac'
brew 'git'
brew 'git'
brew 'glib'
brew 'gnupg'
brew 'golang'
brew 'helm'
brew 'heroku'
brew 'imagemagick'
brew 'ispell'
brew 'jquery'
brew 'kube-ps1'
brew 'kubectl-argo-rollouts'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'libtool' # snappy dependency
brew 'libxslt'
brew 'libyaml'
brew 'lsd' # new ls
brew 'mcfly'
brew 'memcached'
brew 'minikube'
brew 'nvm'
brew 'overmind'
brew 'pipx'
brew 'postgresql@12', restart_service: true
brew 'puma/puma/puma-dev'
brew 'qt'
brew 'redis', restart_service: true
brew 'ripgrep'
brew 'ripgrep-all'
brew 'ruby-build'
brew 'snappy'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vault'
brew 'yarn'

# set arguments for all 'brew cask install' commands
# cask_args appdir: '~/Applications'

# cask '1password'
cask '1password-cli'
cask 'docker'
cask 'iterm2'
# cask 'skype'
# cask 'slack'
cask 'visual-studio-code'
# cask 'cheatsheet'
cask 'aws-vpn-client'
cask 'loom'
cask 'tuple'
